---
type: ElementOwnerViewFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementOwnerViewFilter

`Autodesk.Revit.DB.ElementOwnerViewFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementOwnerViewFilter | — | `` |
| Method | PassesFilter | — | `` |
| Property | ViewId | — | `public ElementId ViewId { get ; }` |